{
    "version": "https://jsonfeed.org/version/1",
    "title": "Just 5 Mins",
    "description": "",
    "home_page_url": "https://justfivemins.github.io/blog",
    "feed_url": "https://justfivemins.github.io/blog/feed.json",
    "user_comment": "",
    "icon": "https://justfivemins.github.io/blog/media/website/Logo-Wip.png",
    "author": {
        "name": "Tryambak Dasgupta"
    },
    "items": [
        {
            "id": "https://justfivemins.github.io/blog/why-housewives-not-homemakers/",
            "url": "https://justfivemins.github.io/blog/why-housewives-not-homemakers/",
            "title": "Why housewives not homemakers?",
            "summary": "The term housewives itself brings huge gender discrimination. It has a link to the female gender. But why should we always link it with the female gender? So, this gender discrimination that has been going on for a century should be stopped. We should be&hellip;",
            "content_html": "<p><strong>The term housewives itself brings huge gender discrimination.</strong> It has a link to the female gender. But why should we always link it with the female gender? So, this gender discrimination that has been going on for a century should be stopped. We should be careful to not discriminate against the female gender. The female gender is not born for house chores like cooking, cleaning, and all other household chores. They are not born just to manage our lives, they can have their own lives and also fulfil all their dreams.<br><br>We have seen this in many cases in which females are emotionally and sometimes physically forced to do all the household chores. This is one of the biggest discriminating issues in our country. Our country always expects a woman to have a successful job life just to manage their house after marriage or to take care of their children. This is a problem that we should all be aware of. We should create a society where women are not forced to leave their jobs or sacrifice their dreams just because they are married or because they are housewives. Women are not made for just household work; they also have their own dreams or goals that they want to achieve.<br><br>Gender roles have changed dramatically over the last few decades. Housewives, this word makes people visualise women dealing with household work. Society has always considered housewives to be jobless. Should we keep believing in this method? A housewife is expected to nurture and cultivate her family. But is this thinking correct any more? Is this stereotype not discriminatory against women? This stereotype has a deep root in our society.<br><br>However, a homemaker is not restricted only to a woman. Before the 20th century, housewives were considered jobless by most of the people in their society. Do you think it is justified? A homemaker is not just a person who carries out household responsibilities but also works towards making their house a home. Since housewives do the same work, don't you think they deserve to be considered as homemakers? Homemakers is a positive word when someone wants to give respect to a housewife. There is an undercurrent of agony in every housewife. That is because of the kind of sacrifice made by her to make her family flourish, so it's a token of respect for her.<br><br>Our mothers are housewives as well as homemakers. We get back to our home every day to get that warmth and satisfaction after a hectic day. Also, it is very subjective. Let us ask you a question. What do you consider your mother to be—a housewife or a homemaker?</p>",
            "image": "https://justfivemins.github.io/blog/media/posts/4/spacejoy-9M66C_w_ToM-unsplash-3.jpg",
            "author": {
                "name": "Tryambak Dasgupta"
            },
            "tags": [
                   "housewives",
                   "homemaker",
                   "gender",
                   "awareness"
            ],
            "date_published": "2022-08-19T03:41:01+05:30",
            "date_modified": "2022-08-19T04:35:48+05:30"
        },
        {
            "id": "https://justfivemins.github.io/blog/hello-world/",
            "url": "https://justfivemins.github.io/blog/hello-world/",
            "title": "Hello World",
            "summary": "Hi :) We, the students of Section - A MBA batch of the Institute of Engineering &amp; Management, Kolkata (2022-2024), are starting our own blog to spread different kinds of awareness among the community. Our Socials: We hope you will enjoy your stay. Stay tuned&hellip;",
            "content_html": "<p><em><strong>Hi :)<br><br></strong></em></p>\n<p>We, the students of Section - A MBA batch of the <strong>Institute of Engineering &amp; Management, Kolkata</strong> (2022-2024), are starting our own blog to spread different kinds of awareness among the community.</p>\n<p><em><strong>Our Socials:</strong></em></p>\n<ul>\n<li><em>Youtube - <a href=\"https://bit.ly/just5minsyt\">https://bit.ly/just5minsyt</a></em></li>\n<li><em>Instagram - <a href=\"https://instagram.com/just5mins2224\">@just5mins2224</a></em></li>\n<li><em>Twitter - <a href=\"https://twitter.com/just5mins_in\">@just5mins_in</a></em></li>\n<li><em>Podcast - <strong>Coming Soon</strong></em></li>\n</ul>\n<p><br>We hope you will enjoy your stay. Stay tuned for more.</p>\n<p> </p>\n<p> </p>",
            "image": "https://justfivemins.github.io/blog/media/posts/1/1_OohqW5DGh9CQS4hLY5FXzA.png",
            "author": {
                "name": "Tryambak Dasgupta"
            },
            "tags": [
            ],
            "date_published": "2022-08-16T21:19:51+05:30",
            "date_modified": "2022-08-19T04:41:31+05:30"
        }
    ]
}
